<a href="https://colab.research.google.com/github/sandy-2001/tensorflow/blob/master/LinearRegression.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
%tensorflow_version 2.x
import tensorflow as tf

date:21-07-2020
# MOdule-3
## Core Learning Algorithms
### Linear Regression

In [ ]:
from __future__ import absolute_import, division,print_function, unicode_literals
''' future helps to prevent the incompatible behaviour of using new version code in older version environment'''

' future helps to prevent the incompatible behaviour of using new version code in older version environment'

In [ ]:
#Basic libraries for Linear Regression
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd

In [ ]:
#Importing extra libraries for tensorflow
from IPython.display import clear_output # clear_output is used to clear the previous output of that code block till it executes

In [ ]:
# six is a package where it supports both python 2 and python 3 (2*3=6) 
#moves module helps to convert one format to another format
# urllib is module related to url links
#urllib consists of four methods
#1.urllib.request-it takes response from browser
#2.urllib.error-contains exceptions while executing urllib response
#3.urllib.parse- used for parse urls
#4.urllib.robotparser-used to parse robot.txt files
from six.moves import urllib

In [ ]:
'''compat gives compatability to write the code in both versions of tensor flow
feature column  are the bridge between raw data and output
There are different types of feature columns
1.Numerical columns:It is dense column where it have fixed real value,can be  directly used for the model
2.Categorical columns:It is categoriaclly splitted one column to n categories indicating with 0 or 1
3.Bucketwised columns:It is mixture of both dense and categorical, ex:ages of certain period

'''
import tensorflow.compat.v2.feature_column as fc
import tensorflow as tf

In [ ]:
#import dataset
x_train=pd.read_csv('http://storage.googleapis.com/tf-datasets/titanic/train.csv')
x_test=pd.read_csv('http://storage.googleapis.com/tf-datasets/titanic/eval.csv')
y_train=x_train.pop('survived')
y_test=x_test.pop('survived')

In [ ]:
x_train

        sex   age  n_siblings_spouses  ...     deck  embark_town alone
0      male  22.0                   1  ...  unknown  Southampton     n
1    female  38.0                   1  ...        C    Cherbourg     n
2    female  26.0                   0  ...  unknown  Southampton     y
3    female  35.0                   1  ...        C  Southampton     n
4      male  28.0                   0  ...  unknown   Queenstown     y
..      ...   ...                 ...  ...      ...          ...   ...
622    male  28.0                   0  ...  unknown  Southampton     y
623    male  25.0                   0  ...  unknown  Southampton     y
624  female  19.0                   0  ...        B  Southampton     y
625  female  28.0                   1  ...  unknown  Southampton     n
626    male  32.0                   0  ...  unknown   Queenstown     y

[627 rows x 9 columns]

In [ ]:
x_test

        sex   age  n_siblings_spouses  ...     deck  embark_town alone
0      male  35.0                   0  ...  unknown  Southampton     y
1      male  54.0                   0  ...        E  Southampton     y
2    female  58.0                   0  ...        C  Southampton     y
3    female  55.0                   0  ...  unknown  Southampton     y
4      male  34.0                   0  ...        D  Southampton     y
..      ...   ...                 ...  ...      ...          ...   ...
259  female  25.0                   0  ...  unknown  Southampton     n
260    male  33.0                   0  ...  unknown  Southampton     y
261  female  39.0                   0  ...  unknown   Queenstown     n
262    male  27.0                   0  ...  unknown  Southampton     y
263    male  26.0                   0  ...        C    Cherbourg     y

[264 rows x 9 columns]

In [ ]:
#Encoding the data
categorical_columns=['sex','n_siblings_spouses','parch','class','deck','embark_town','alone']

numerical_columns=['age','fare']

In [ ]:
feature_coulumns=[]

for feature_name in categorical_columns:
  vocabulary=x_train[feature_name].unique()  #according to ml this step is equal to get_dummies
  feature_coulumns.append(tf.feature_column.categorical_column_with_vocabulary_list(feature_name,vocabulary))

for feature_name in numerical_columns:
  feature_coulumns.append(tf.feature_column.numeric_column(feature_name,dtype=tf.float32))

In [ ]:
print(feature_coulumns)

[VocabularyListCategoricalColumn(key='sex', vocabulary_list=('male', 'female'), dtype=tf.string, default_value=-1, num_oov_buckets=0), VocabularyListCategoricalColumn(key='n_siblings_spouses', vocabulary_list=(1, 0, 3, 4, 2, 5, 8), dtype=tf.int64, default_value=-1, num_oov_buckets=0), VocabularyListCategoricalColumn(key='parch', vocabulary_list=(0, 1, 2, 5, 3, 4), dtype=tf.int64, default_value=-1, num_oov_buckets=0), VocabularyListCategoricalColumn(key='class', vocabulary_list=('Third', 'First', 'Second'), dtype=tf.string, default_value=-1, num_oov_buckets=0), VocabularyListCategoricalColumn(key='deck', vocabulary_list=('unknown', 'C', 'G', 'A', 'B', 'D', 'F', 'E'), dtype=tf.string, default_value=-1, num_oov_buckets=0), VocabularyListCategoricalColumn(key='embark_town', vocabulary_list=('Southampton', 'Cherbourg', 'Queenstown', 'unknown'), dtype=tf.string, default_value=-1, num_oov_buckets=0), VocabularyListCategoricalColumn(key='alone', vocabulary_list=('n', 'y'), dtype=tf.string, default_value=-1, num_oov_buckets=0), NumericColumn(key='age', shape=(1,), default_value=None, dtype=tf.float32, normalizer_fn=None), NumericColumn(key='fare', shape=(1,), default_value=None, dtype=tf.float32, normalizer_fn=None)]

# new terms:epoch and batches
## when there is more data to train,batch wise the data gets trained .
##epoch is train the same data recurrently in different manners.**bold text**

In [ ]:
def make_input_fn(data_df,label_df,num_epochs=10,shuffle=True, batch_size=32):
  #it is a local funtion in make_input_fn.The parameters are also available for this function
  def input_function():
    ds=tf.data.Dataset.from_tensor_slices((dict(x_train),y_train)) #creating dataset object used to repeat the dataset in epochs
    if shuffle:
      ds = ds.shuffle(1000)#shuffling the data
    ds=ds.batch(batch_size).repeat(num_epochs) #repeating the same function num_echo times
    return ds
  return input_function

data_train=make_input_fn(x_train,y_train)
data_test=make_input_fn(x_test,y_test,num_epochs=1, shuffle=False)

In [ ]:
#estimator is the module where all the basic algorithms are placed
lin=tf.estimator.LinearClassifier(feature_columns=feature_coulumns)#object created for Linear Classifier
lin.train(data_train)
result=lin.evaluate(data_test)

clear_output()
print(result['accuracy'])

0.8229665